# -*- coding: utf-8 -*-
# UTF-8 encoding when using korean



문제리스트 = ['ㅇㅋ','ㅇㅇ','ㅎㅇ','ㄱㅅ','ㅂㅂ','ㅌㅌ','ㄷㄷ/ㅎㄷㄷ','ㄱㄷ','ㅅㄹ','ㅁㄹ','ㅇㅈ','ㄹㅇ','ㄱㅎ','ㄲㅂ','ㄱㅇㅂ','ㄱㅇㄷ','ㅂㄷㅂㄷ','ㅌㄷㅌㄷ','ㅇㄱㄹㅇ','ㅂㅂㅂㄱ','비담','멘붕','볼매','관종','엄빠','욜로','노잼','돌싱','알못','페메','엄카','마상','영고','맛저','즐데','핑프','생선','문상','읽씹','노답','길막','궁물','심쿵','심멎','맴찢','케미','시강','열폭','움짤','갈비','안습','프사','상메','스압','작폐','게이','게하','취존','개취','현타','따아','아아','광탈','광클','설리','빛삭','맥날','베라','현백','빠바','새터','세젤귀','세젤예','잘생쁨','존예','존잘','존맛탱','탕진잼','궁예질','치깅스','케바케','사바사','제곧내','솔까말','말잇못','지못미','갑툭튀','흠좀무','근자감','존좋템','패완얼','듣보잡','버카충','가성비','금사빠','넌씨눈','피꺼솟','답정너','여병추','일상가','먹부심','별다줄','유남생','넘사벽','낄끼빠빠','복세편살','나씨나길','안물안궁','빼박캔트','할말하않','맘충','식충','설명충','틀딱충','급식충','학식충','시발비용','멍청비용','학세권','숲세권','스세권','맥세권','ㅇ알못','와우네(와우내)','창렬','혜자','큰그림','빅픽쳐','팩트폭력','헬조선','지옥불반도','천조국','불곰국','카레국','홍차국','빵국','왜국','애니국','성진국','짱깨국','대륙','고구마','사이다','단호박','브금','문찐','현질','현피','딥빡','더럽','려차','셀기꾼','자라니','츤데레','흑역사','뇌피셜','기레기','어그로','정주행','낫닝겐','난희골혜','인생짤','인생사진','대프리카','고나리','고나리자','브로맨스','오지랖퍼','하드캐리','프로불편러','덕후','덕질','입덕','탈덕','휴덕','성덕','덕통사고','어덕행덕','최애','차애','팬아저','일코','머글','야민정음','커엽','댕댕이','띵작','댕청하다','세종머앟','머장','머학교','머ㅋ','싀혜','ㅇㅇ팡역시','푸라면','ㅇ튽','끠꺼속','윾니클로','윾재석','서류가즘','사축','월급루팡','부장인턴','금턴','호모인턴스','메신저감옥','카톡감옥','월급로그아웃','알부자','갓수','취업깡패','전화기','문송합니다','관태기','헌내기','아싸','인싸','혼밥','혼술','인구론','리즈시절','1코노미','혼바비언']

해설리스트 = ['오케이','알겠어','하이','감사','바이바이','도망가','후덜덜(두려움)','기다려','싫어','몰라','인정','레알','극혐','아깝다(까비)','개오바','개이득','부들부들(화남의표현)','토닥토닥(위로의표현)','이거레알','반박불가','비주얼 담당','멘탈의 붕괴','볼수록 매력적이다','관심종자','엄마+아빠','You Only Live Once','재미가 없다','돌아온 싱글','알지도 못하면서/못한다','페이스북 메시지','엄마카드','마음의 상처','영원히 고통받는','맛있는 저녁(저녁 맛있게먹어~)','즐거운 데이트(데이트 즐겁게해~)','핑거프린세스(직접 찾아보지 않고 묻기만 하는 사람)','생일선물','문화상품권','읽고 씹는 것(문자메세지등의 SNS연락을 확인하고 답장하지 않는 행위)','답이 없다','길을 막다','궁금한 것을 물어보다','심장이 쿵쾅거린다','심장이 멎는다','마음이 찢어진다','대상들 끼리 아주 잘 어울리는 것','시선강탈(시선을 빼앗다)','열등감 폭팔','움직이는 짤방(GIF이미지)','갈수록 비호감','안구에 습기가 찬다(못볼 꼴을 보았다)','프로필사진','(카카오톡등의)상태 메시지','스크롤 압박','작은친절, 큰민폐','게시판 이용자','게스트 하우스','취향의 존중','개인의 취향','현자타임(현실자각을 하게되는 시간)','따듯한 아메리카노','아이스 아메리카노','광속탈락','광속의 클릭','설레이는 리플','빛의속도로 삭제하다','맥도날드','베스킨라빈스','현대백화점','파리바게트','새내기배움터','세상에서 제일 귀여운','세상에서 제일 예쁜','잘생김 + 예쁨','존X예쁨','존X잘생김','존X맛있음 + 강조하는 의미의 탱','돈을 탕진하며 얻는 재미','근거없이 멋대로 추측하고 판단해버리는 행위','치마레깅스','Case By Case','사람 By 사람','제목이 곧 내용','솔직히 까놓고 말해서','말을 잇지 못한다','지켜주지 못해서 미안해','갑자기 툭 튀어나오다','흠, (이게사실이라면)좀 무섭다','근거없는 자신감','X나 좋은 아이템','패션의 완성은 얼굴','듣고 보지도 못한 잡스러운것','버스카드충전','가격대비 성능비','금방 사랑에 빠지는 사람','너는 씨X 눈치도없냐','피가 거꾸로 솟는다','답은 정해져있고 너는 대답만 하면 돼','여기 병신하나 추가요','일상생활가능?','먹는일에 느끼는 자부심','별걸 다 줄인다','You Know What I am Saying?','넘을 수 없는 사차원의 벽','낄때 끼고 빠질때 빠지자','복잡한 세상 편하게 살자','나는 씨X 나만의 길을간다','안물어봤고, 안궁금하다','빼도박도 못하다','할말은 많지만 하지만 하지 않는다','공공장소에서 자신의 아이만 소중히 생각하고 타인에게 주는 피해에 대해서는 관대한 부모를 비꼬는 말','밥만 축내는 사람','딱히 풀이할 필요가 없는 사안까지도 진지하게 설명하는 사람','틀니를 딱딱거린다는 의미로 극단적 보수 성향을 가진 노년층을 비하하는 단어','급식을 먹는 중고등학생을 비하하는 단어','학식을 먹는 대학생을 비하하는 단어','스트레스 또는 화로인해 소비하게되는 돈','멍청하지 않았으면 나가지 않았을 돈','학교가 가까운 지역','주위에 공원이나 숲이 있는 지역','주위에 스타벅스가 있는 지역','주위에 맥도날드가 있어 배달이 용이한 지역','무언가에 대해 잘 알지 못하다','Wow + ~네 (놀람의 표현)','광고나 사진, 가격과 달리 내용물이 부실한 경우를 뜻하는 단어로, 가수 김창렬 본인의 얼굴을 내걸고 출시한 식품의 내용물이 굉장히 부실해서 발생된 단어','제품의 구성이나 양이 다양하거나 가격대비 질 좋은 경우를 뜻하는 단어로, 탤런트 김혜자가 본인의 이름을 걸고 출시한 식품의 양과 질이 좋아서 발생된 단어','크게 볼줄 안다는 의미','"큰 그림"과 같이 크게 볼줄 안다는 의미','사실을 기반으로 상대방의 정곡을 찌르는 말','청년실업과 전세난등 심각한 사회문제를 안고있는 우리나라의 상황을 빗댄 말','헬조선과 마찬가지로 청년실업과 전세난등 심각한 사회문제를 안고있는 우리나라의 상황을 빗댄 말','미국','러시아','인도','영국','프랑스','일본','일본','일본','중국','중국','고구마를 먹은 듯 속이 답답하다','사이다를 마신 듯 속이 시원하다','단호한 사람','BGM을 발음대로 읽은 표현','문화/문명의 찐따','현금을 지르다','온라인에서 시비가 붙은 사람끼리 오프라인 현실에서 싸우는 것을 의미','깊게 화나다','The Love','“Fuxk”욕을 한글자판으로 친 욕','셀카사기꾼','교통법규를 무시하며 고라니처럼 불쑥 튀어나와 운전자에게 공포의 대상이 되는 자전거족을 일컫는 단어','겉으론 퉁명스럽지만 속으론 따듯한 마음을 가진 사람','기억하고 싶지 않은 부끄러운 과거','공식 문서나 신문기사등의 보도가 아닌 자신의 뇌속 망상을 사실인냥 지껄이는 것','특종을 노리려 추측성 기사를 쓰고, 사실이 아닌 것으로 밝혀지면 사과하지않는 기자를 비하하는 말','관심(을 끌다)','드라마나 만화를 첫화부터 다시 감상하는 행위','인간이 아니다','나니고레?','“인생사진”과 마찬가지로 인생을 통틀어 한번 나올까 말까한 사진','“인생짤”과 마찬가지로 인생을 통틀어 한번 나올까 말까한 사진','아프리카처럼 더운 대구를 지칭하는 말','“관리”의 오타로, 잔소리를 의미','“관리자”의 오타로, 잔소리를 하는사람','Brother + Romance의 합성어로, 남성끼리의 매우 친근한 관계를 일컫는 말','오지랖이 넓은 사람','게임이나 스포츠, 조별과제 등에서 크게 활약한 사람에게 사용하는 단어','쓸데없는 트집잡기에만 혈안이 된 사람을 비꼬는 단어','일본어 오타쿠를 한국식으로 발음한 것으로 특정 팬임을 지칭','자신이 좋아하는 분야에 대해 파고드는 행동','무언가의 덕후가 되었다는 의미','무언가의 덕후에서 나왔다는 의미','덕질을 잠시 쉬고있다는 의미','성공한 덕후','교통사고처럼 갑작스럽게 어떤분야/대상의 덕후가 되는 것','어차피 덕후질할꺼 행복하게 덕후질하자','최고로 애정하는 것','차순위로(그 다음으로) 애정하는 것','팬은 아닌데 (대상의)사진을 저장하다','일반인 코스프레','일반인을 지칭하는 단어','야매 + 훈민정음','“귀엽”과 형태가 비슷하여 사용하는 야민정음','“멍멍이”와 형태가 비슷하여 사용하는 야민정음','“명작”과 형태가 비슷하여 사용하는 야민정음','“멍청하다”와 형태가 비슷하여 사용하는 야민정음','“세종대왕”과 형태가 비슷하여 사용하는 야민정음','“대장”과 형태가 비슷하여 사용하는 야민정음','“대학교”와 형태가 비슷하여 사용하는 야민정음','“대구”와 형태가 비슷하여 사용하는 야민정음','“식혜”와 형태가 비슷하여 사용하는 야민정음','“ㅇㅇ광역시”와 형태가 비슷하여 사용하는 야민정음','“辛라면(신라면)”과 형태가 비슷하여 사용하는 야민정음','“ㅇ長”(ex 교튽, 사튽)과 형태가 비슷하여 사용하는 야민정음','“피꺼솟”과 형태가 비슷하여 사용하는 야민정음','“유니클로”와 형태가 비슷하여 사용하는 야민정음','“유재석”과 형태가 비슷하여 사용하는 야민정음','서류면접의 통과시에 느끼는 기쁨을 표현한 단어','회사의 가축','하는일 없이 월급만 축내는 직원','오랜 인턴생활로 부장만큼 풍부한 경험을 한 인턴사원','정규직 전환이 보장되어있거나 전환률이 높은 인턴자리','정규직이 되지 못한 채 인턴생활만 전전하는 세대','메신저를 통해 언제 어디서든 업무지시를 받는 상황을 빗댄 표현','메신저감옥과 마찬가지로, 메신저를 통해 언제 어디서든 업무지시를 받는 상황을 빗댄 표현','들어오자마자 없어지는 월급을 빗댄 표현','여러종류의 아르바이트를 동시에 하는 사람','일반인보다 풍족하고 여유로운 백수','다른 사람/학과 에 비해 취업을 잘 할 수 있는 사람/학과','상대적으로 취직이 잘되는 전기전자/화학공학/기계공학 전공의 줄임말','문과라서 죄송합니다','모든 사람과의 관계에 권태기를 느끼는 20대 시기','새내기를 벗어난 고학년의 대학생을 빗댄 표현','아웃사이더 (친구가 없어 소외된 사람)를 이르는 말','아웃사이더의(아싸) 반의어','혼자서 먹는 밥','혼자서 마시는 술','인구의 90%는 논다','전성기','혼자만의 소비생활을 즐기는 사람','혼자 밥을 먹는 사람']
#문제 난이도별 단어리스트
상문제=['볼매','영고','핑프','궁물','궁금한 것을 물어보다','갈비','작폐','게이','설리','탕진잼','궁예질','제곧내','일상가','유남생','낄끼빠빠','복세편살','나씨나길','할말하않','시발비용','멍청비용','학세권','숲세권','스세권','맥세권','ㅇ알못','와우네(와우내)','창렬','혜자','딥빡','더럽','려차','셀기꾼','자라니','뇌피셜','기레기','난희골혜','고나리','고나리자','오지랖퍼','하드캐리','프로불편러','팬아저','일코','머글','야민정음','커엽','댕댕이','띵작','댕청하다','세종머앟','머장','머학교','머ㅋ','싀혜','ㅇㅇ팡역시','푸라면','ㅇ튽','끠꺼속','윾니클로','윾재석','서류가즘','사축','월급루팡','부장인턴','금턴','호모인턴스','메신저감옥','카톡감옥','월급로그아웃','알부자','갓수','취업깡패','전화기','문송합니다','관태기','헌내기','인구론','리즈시절','1코노미','혼바비언']
상문제해설=['볼수록 매력적이다','영원히 고통받는','핑거프린세스(직접 찾아보지 않고 묻기만 하는 사람)','갈수록 비호감','작은친절, 큰민폐','게시판 이용자','설레이는 리플','돈을 탕진하며 얻는 재미','근거없이 멋대로 추측하고 판단해버리는 행위','제목이 곧 내용','일상생활가능?','You Know What I am Saying?','낄때 끼고 빠질때 빠지자','복잡한 세상 편하게 살자','나는 씨X 나만의 길을간다','할말은 많지만 하지만 하지 않는다','스트레스 또는 화로인해 소비하게되는 돈','멍청하지 않았으면 나가지 않았을 돈','학교가 가까운 지역','주위에 공원이나 숲이 있는 지역','주위에 스타벅스가 있는 지역','주위에 맥도날드가 있어 배달이 용이한 지역','무언가에 대해 잘 알지 못하다','Wow + ~네 (놀람의 표현)','광고나 사진, 가격과 달리 내용물이 부실한 경우를 뜻하는 단어로, 가수 김창렬 본인의 얼굴을 내걸고 출시한 식품의 내용물이 굉장히 부실해서 발생된 단어','제품의 구성이나 양이 다양하거나 가격대비 질 좋은 경우를 뜻하는 단어로, 탤런트 김혜자가 본인의 이름을 걸고 출시한 식품의 양과 질이 좋아서 발생된 단어','깊게 화나다','The Love','“Fuxk”욕을 한글자판으로 친 욕','셀카사기꾼','교통법규를 무시하며 고라니처럼 불쑥 튀어나와 운전자에게 공포의 대상이 되는 자전거족을 일컫는 단어','공식 문서나 신문기사등의 보도가 아닌 자신의 뇌속 망상을 사실인냥 지껄이는 것','특종을 노리려 추측성 기사를 쓰고, 사실이 아닌 것으로 밝혀지면 사과하지않는 기자를 비하하는 말','나니고레?','“관리”의 오타로, 잔소리를 의미','“관리자”의 오타로, 잔소리를 하는사람','오지랖이 넓은 사람','게임이나 스포츠, 조별과제 등에서 크게 활약한 사람에게 사용하는 단어','쓸데없는 트집잡기에만 혈안이 된 사람을 비꼬는 단어','팬은 아닌데 (대상의)사진을 저장하다','일반인 코스프레','일반인을 지칭하는 단어','야매 + 훈민정음','“귀엽”과 형태가 비슷하여 사용하는 야민정음','“멍멍이”와 형태가 비슷하여 사용하는 야민정음','“명작”과 형태가 비슷하여 사용하는 야민정음','“멍청하다”와 형태가 비슷하여 사용하는 야민정음','“세종대왕”과 형태가 비슷하여 사용하는 야민정음','“대장”과 형태가 비슷하여 사용하는 야민정음','“대학교”와 형태가 비슷하여 사용하는 야민정음','“대구”와 형태가 비슷하여 사용하는 야민정음','“식혜”와 형태가 비슷하여 사용하는 야민정음','“ㅇㅇ광역시”와 형태가 비슷하여 사용하는 야민정음','“辛라면(신라면)”과 형태가 비슷하여 사용하는 야민정음','“ㅇ長”(ex 교튽, 사튽)과 형태가 비슷하여 사용하는 야민정음','“피꺼솟”과 형태가 비슷하여 사용하는 야민정음','“유니클로”와 형태가 비슷하여 사용하는 야민정음','“유재석”과 형태가 비슷하여 사용하는 야민정음','서류면접의 통과시에 느끼는 기쁨을 표현한 단어','회사의 가축','하는일 없이 월급만 축내는 직원','오랜 인턴생활로 부장만큼 풍부한 경험을 한 인턴사원','정규직 전환이 보장되어있거나 전환률이 높은 인턴자리','정규직이 되지 못한 채 인턴생활만 전전하는 세대','메신저를 통해 언제 어디서든 업무지시를 받는 상황을 빗댄 표현','메신저감옥과 마찬가지로, 메신저를 통해 언제 어디서든 업무지시를 받는 상황을 빗댄 표현','들어오자마자 없어지는 월급을 빗댄 표현','여러종류의 아르바이트를 동시에 하는 사람','일반인보다 풍족하고 여유로운 백수','다른 사람/학과 에 비해 취업을 잘 할 수 있는 사람/학과','상대적으로 취직이 잘되는 전기전자/화학공학/기계공학 전공의 줄임말','문과라서 죄송합니다','모든 사람과의 관계에 권태기를 느끼는 20대 시기','새내기를 벗어난 고학년의 대학생을 빗댄 표현','인구의 90%는 논다','전성기','혼자만의 소비생활을 즐기는 사람','혼자 밥을 먹는 사람']
중문제=['ㅇㄱㄹㅇ','ㅂㅂㅂㄱ','비담','욜로','돌싱','알못','엄카','마상','맛저','즐데','심쿵','심멎','맴찢','케미','시강','열폭','움짤','스압','게하','취존','개취','현타','따아','아아','빛삭','맥날','베라','현백','빠바','새터','세젤귀','세젤예','잘생쁨','존예','존잘','존맛탱','치깅스','케바케','사바사','솔까말','말잇못','지못미','갑툭튀','흠좀무','근자감','존좋템','패완얼','듣보잡','버카충','가성비','금사빠','넌씨눈','피꺼솟','답정너','여병추','먹부심','별다줄','넘사벽','안물안궁','빼박캔트','맘충','식충','설명충','틀딱충','급식충','학식충','큰그림','빅픽쳐','팩트폭력','헬조선','천조국','불곰국','카레국','홍차국','빵국','성진국','대륙','고구마','사이다','단호박','브금','문찐','현질','현피','츤데레','어그로','정주행','낫닝겐','인생짤','대프리카','브로맨스','덕질','입덕','탈덕','휴덕','성덕','덕통사고','어덕행덕','최애','차애','아싸','인싸','혼밥','혼술']
중문제해설=['이거레알','반박불가','비주얼 담당','You Only Live Once','돌아온 싱글','알지도 못하면서/못한다','엄마카드','마음의 상처','맛있는 저녁(저녁 맛있게먹어~)','즐거운 데이트(데이트 즐겁게해~)','심장이 쿵쾅거린다','심장이 멎는다','마음이 찢어진다','대상들 끼리 아주 잘 어울리는 것','시선강탈(시선을 빼앗다)','열등감 폭팔','움직이는 짤방(GIF이미지)','스크롤 압박','게스트 하우스','취향의 존중','개인의 취향','현자타임(현실자각을 하게되는 시간)','따듯한 아메리카노','아이스 아메리카노','빛의속도로 삭제하다','맥도날드','베스킨라빈스','현대백화점','파리바게트','새내기배움터','세상에서 제일 귀여운','세상에서 제일 예쁜','잘생김 + 예쁨','존X예쁨','존X잘생김','존X맛있음 + 강조하는 의미의 탱','치마레깅스','Case By Case','사람 By 사람','솔직히 까놓고 말해서','말을 잇지 못한다','지켜주지 못해서 미안해','갑자기 툭 튀어나오다','흠, (이게사실이라면)좀 무섭다','근거없는 자신감','X나 좋은 아이템','패션의 완성은 얼굴','듣고 보지도 못한 잡스러운것','버스카드충전','가격대비 성능비','금방 사랑에 빠지는 사람','너는 씨X 눈치도없냐','피가 거꾸로 솟는다','답은 정해져있고 너는 대답만 하면 돼','여기 병신하나 추가요','먹는일에 느끼는 자부심','별걸 다 줄인다','넘을 수 없는 사차원의 벽','안물어봤고, 안궁금하다','빼도박도 못하다','공공장소에서 자신의 아이만 소중히 생각하고 타인에게 주는 피해에 대해서는 관대한 부모를 비꼬는 말','밥만 축내는 사람','딱히 풀이할 필요가 없는 사안까지도 진지하게 설명하는 사람','틀니를 딱딱거린다는 의미로 극단적 보수 성향을 가진 노년층을 비하하는 단어','급식을 먹는 중고등학생을 비하하는 단어','학식을 먹는 대학생을 비하하는 단어','크게 볼줄 안다는 의미','"큰 그림"과 같이 크게 볼줄 안다는 의미','사실을 기반으로 상대방의 정곡을 찌르는 말','청년실업과 전세난등 심각한 사회문제를 안고있는 우리나라의 상황을 빗댄 말','미국','러시아','인도','영국','프랑스','일본','중국','고구마를 먹은 듯 속이 답답하다','사이다를 마신 듯 속이 시원하다','단호한 사람','BGM을 발음대로 읽은 표현','문화/문명의 찐따','현금을 지르다','온라인에서 시비가 붙은 사람끼리 오프라인 현실에서 싸우는 것을 의미','겉으론 퉁명스럽지만 속으론 따듯한 마음을 가진 사람','관심(을 끌다)','드라마나 만화를 첫화부터 다시 감상하는 행위','인간이 아니다','“인생사진”과 마찬가지로 인생을 통틀어 한번 나올까 말까한 사진','아프리카처럼 더운 대구를 지칭하는 말','Brother + Romance의 합성어로, 남성끼리의 매우 친근한 관계를 일컫는 말','자신이 좋아하는 분야에 대해 파고드는 행동','무언가의 덕후가 되었다는 의미','무언가의 덕후에서 나왔다는 의미','덕질을 잠시 쉬고있다는 의미','성공한 덕후','교통사고처럼 갑작스럽게 어떤분야/대상의 덕후가 되는 것','어차피 덕후질할꺼 행복하게 덕후질하자','최고로 애정하는 것','차순위로(그 다음으로) 애정하는 것','아웃사이더 (친구가 없어 소외된 사람)를 이르는 말','아웃사이더의(아싸) 반의어','혼자서 먹는 밥','혼자서 마시는 술']
하문제=['ㅇㅋ','ㅇㅇ','ㅎㅇ','ㄱㅅ','ㅂㅂ','ㅌㅌ','ㄷㄷ/ㅎㄷㄷ','ㄱㄷ','ㅅㄹ','ㅁㄹ','ㅇㅈ','ㄹㅇ','ㄱㅎ','ㄲㅂ','ㄱㅇㅂ','ㄱㅇㄷ','ㅂㄷㅂㄷ','ㅌㄷㅌㄷ','멘붕','관종','엄빠','노잼','페메','생선','문상','읽씹','노답','길막','안습','프사','상메','광탈','광클','흑역사','덕후']
하문제해설=['오케이','알겠어','하이','감사','바이바이','도망가','후덜덜(두려움)','기다려','싫어','몰라','인정','레알','극혐','아깝다(까비)','개오바','개이득','부들부들(화남의표현)','토닥토닥(위로의표현)','멘탈의 붕괴','관심종자','엄마+아빠','재미가 없다','페이스북 메시지','생일선물','문화상품권','읽고 씹는 것(문자메세지등의 SNS연락을 확인하고 답장하지 않는 행위)','답이 없다','길을 막다','안구에 습기가 찬다(못볼 꼴을 보았다)','프로필사진','(카카오톡등의)상태 메시지','광속탈락','광속의 클릭','기억하고 싶지 않은 부끄러운 과거','일본어 오타쿠를 한국식으로 발음한 것으로 특정 팬임을 지칭']
#상중하 문제만들때 위에 문제리스트랑 해설리스트랑 똑같이 만들어야한다 오타치면 ㅏ안도ㅙㅐ
#이거를 딕션어리로 만들기

import time
def countdown():
    n=3
    while n>0:
        print(n)
        time.sleep(1)
        n=n-1


#def load_nwd():#랭킹
#   file=open("nwd.txt","r")
#   #print(file)
#   ss=[[]]
#   for _ in range(4):
#       a=file.readline()
#       ss[0].append(a)
#   return ss
#   file.close()



#def store_nwd():
#   file=open("nwd.txt","r+")
#   file.read()
#   line=namee + '\n' + str(age) + '\n' + str(level) + '\n' + str(score1) + '\n'
#   file.write(line)
#   file.close()



def askag(sav):
    while not (sav=='ㅇㅇ' or sav=='ㄴㄴ'):
        print("잘못입력하셨습니다.")
        sav=input("ㅇㅇ과 ㄴㄴ만 입력해주세요.:")
    return sav



def inword():
    a=input("모르는 단어를 입력하세요.:")
    for x in range(223):
        if a == 문제리스트[x]:
            print(해설리스트[x])



def age_recomend():
    if age <= 20:
        print("상 난이도를 추천드립니다.")
    elif 20 < age <= 30:
        print("중 난이도를 추천드립니다.")
    elif 30 < age :
        print("하 난이도를 추천드립니다.")

def classs():
    if level == '상':
        if score1 == 100:
            print(namee,"님은 '신조어 창조자'등급입니다")
        elif 90 <= score1 < 100:
            print(namee, "님은 '공동제작자'등급입니다")
        elif 70 <= score1 < 90:
            print(namee, "님은 '신조어 전문가'등급입니다")
        elif 50 <= score1 < 70:
            print(namee, "님은 '온라人'등급입니다")
        elif score1 < 50 :
            print(namee, "님은 '중단계 문제가 어울리는'등급입니다")
    elif level == '중':
        if score1 == 100:
            print(namee, "님은 '상단계 문제가 어울리는'등급입니다")
        elif 90 <= score1 < 100:
            print(namee, "님은 '블로거'등급입니다")
        elif 70 <= score1 < 90:
            print(namee, "님은 '중고등학생과 말이 통하는'등급입니다")
        elif 50 <= score1 < 70:
            print(namee, "님은 '일반인' 등급입니다")
        elif score1 < 50:
            print(namee, "님은 '하단계 문제가 어울리는'등급입니다")
    elif level == '하':
        if score1 == 100:
            print(namee, "님은 '중단계 문제가 어울리는'등급입니다")
        elif 90 <= score1 < 100:
            print(namee, "님은 '뭔가 살짝 아쉬운'등급입니다")
        elif 70 <= score1 < 90:
            print(namee, "님은 '아재'등급입니다")
        elif 50 <= score1 < 70:
            print(namee, "님은 '온라인계의 아싸'등급입니다")
        elif score1 < 50:
            print(namee, "님께서는 컴퓨터가 무엇인지 알고 계시나요?")
    elif level == '랜덤':
        if score1 == 100:
            print(namee, "님은 '상단계 문제가 어울리는'등급입니다")
        elif 90 <= score1 < 100:
            print(namee, "님은 '블로거'등급입니다")
        elif 70 <= score1 < 90:
            print(namee, "님은 '일반인'등급입니다")
        elif 50 <= score1 < 70:
            print(namee, "님은 '중단계 문제가 어울리는' 등급입니다")
        elif score1 < 50:
            print(namee, "님은 '하단계 문제가 어울리는'등급입니다")



wrong_prolist=[]
wrong_explist=[]
def print_pro(listt):
    def loop(listt,score1,do_num):
        if listt != []:
            lis_fir=listt[0]
            ind_num=해설리스트.index(lis_fir)
            print(do_num,"/10")
            print(lis_fir,"(이)라는 의미의 신조어는 무엇일까요??")
            ans=input("답:")
            if ans==문제리스트[ind_num]:
                print("맞았습니다!!! ㅊㅊ")
                score1=score1+10
                print("")
            else:
                print("틀렸어요..ㄲㅂ")
                time.sleep(1)
                print("정답은..",문제리스트[ind_num],"입니다.")
                wrong_prolist.append(문제리스트[ind_num])
                wrong_explist.append(해설리스트[ind_num])
                print("")
            listt.remove(lis_fir)
            time.sleep(2)
            return loop(listt,score1,do_num+1)
        else:
            print("문제 종료!!!!!!")
            time.sleep(2)
            print("당신의 점수는....?")
            countdown()
            print("당신의 점수는",score1,"/100점 입니다!!")
            print("")
        time.sleep(2)
        print("문제를 푸셨다면 복습을 하셔야 합니다..")
        rev=input("복습을 원하신다면 ㅇㅇ, 귀찮으면 ㄴㄴ을 누르세요!:")
        rev=askag(rev)
        if (rev=='ㅇㅇ'):
            print("")
            print("복습해보자~~!!")
            #print("너가 틀린 문제는",wrong_prolist.count(),"개 있어")
            while wrong_prolist != []:
                time.sleep(2)
                print(wrong_prolist[0],"의 뜻은",wrong_explist[0])
                wrong_prolist.remove(wrong_prolist[0])
                wrong_explist.remove(wrong_explist[0])
            time.sleep(2)
            print("복습 끝~~~~")
            return score1
        else:
            return score1
    return loop(listt,0,1)
#꼬리재귀로 짜기!!!!!1



#def print_pro(listt):#이거는 while문으로 만드는거
#    score1=0
#    do_num=1
#    wrong_prolist=[]
#    wrong_explist=[]
#    while True:
#        if listt != []:
#            lis_fir=listt[0]
#            ind_num=해설리스트.index(lis_fir)
#            print(do_num,"/10")#총문제중에 몇번째 문제인지 알려주는거
#            print(lis_fir,"(이)라는 의미의 신조어는 무엇일까요??")
#            ans=input("답:")
#            if ans==문제리스트[ind_num]:
#                print("맞았습니다!!! ㅊㅊ")
#                score1=score1+10
#            else:
#                print("틀렸어..에휴ㅠ")
#                time.sleep(1)
#                print("정답은..",문제리스트[ind_num],"이여.")
#                wrong_prolist.append(문제리스트[ind_num])#틀린 문제를 이 리스트에다가 저장을 해서 나중에 복습할떄 꺼낼 수 있게.
#                wrong_explist.append(해설리스트[ind_num])
#            listt.remove(lis_fir)
#            do_num=do_num+1
#            time.sleep(2)
#        else:
#            break
#    print("문제 종료!!!!!!")
#    time.sleep(2)
#    print("당신의 점수는....?")
#    countdown()
#    print("당신의 점수는",score1,"/100점 입니다!!")
#    time.sleep(2)
#    print("문제를 푸셨다면 복습을 하셔야 합니다..")
#    rev=input("복습을 원하신다면 y, 귀찮으면 n을 누르세요!:")
#    rev=askag(rev)
#    if (rev=='Y' or rev=='y'):
#        print("복습해보자~~!!")
#print("너가 틀린 문제는",wrong_prolist.count(),"개 있어")
#        while wrong_prolist != []:
#            time.sleep(2)
#            print(wrong_prolist[0],"의 뜻은",wrong_explist[0])
#            wrong_prolist.remove(wrong_prolist[0])
#            wrong_explist.remove(wrong_explist[0])
#        time.sleep(2)
#        print("복습 끝~~~~")
#    else:
#        print("복습하지마..")
#while 문으로 짠거!!!!!!!!1





#def review_pro():
#    print("문제를 푸셨다면 복습을 하셔야 합니다..")
#    rev=input("복습을 원하신다면 y, 귀찮으면 n을 누르세요!:")
#    askag(rev)
#    if (rev=='Y' or rev=='y'):
#        print("복습해보자~~!!")
#        print("너가 틀린 문제는",wrong_prolist.count(),"개 있어")
#        while wrong_prolist != []:
#            time.sleep(1)
#            print(wrong_prolist[0],"의 뜻은",wrong_explist[0])
#            wrong_prolist.remove(wrong_prolist[0])
#            wrong_explist.remove(wrong_explist[0])
#    else:
#        print("복습하지마..")
from tkinter import*
class App(Frame):
    def __init__(self,review):
        self.review=review
    
    def __init__(self, window):
        super().__init__(window)
        self.pack(padx=20, pady=20)
        self.create_widgets()
    
    def create_widgets(self):
        Label(self, text="★").grid(row=0, column=0, sticky=E)
        #self.namee = Entry(self,width = 10)
        #self.namee.grid(row=0, column=1)
        Button(self, text="확인", command=self.quit).grid(row=0, column=1)
        Label(self, text="★★").grid(row=1, column=0, sticky=E)
        Button(self, text="확인", command=self.quit).grid(row=1, column=1)
        Label(self, text="★★★").grid(row=2, column=0, sticky=E)
        Button(self, text="확인", command=self.quit).grid(row=2, column=1)
        Label(self, text="★★★★").grid(row=3, column=0, sticky=E)
        Button(self, text="확인", command=self.quit).grid(row=3, column=1)
        Label(self, text="★★★★★").grid(row=4, column=0, sticky=E)
        Button(self, text="확인", command=self.quit).grid(row=4, column=1)





import random
def solvepro():
    level=input("난이도를 선택하세요.(상,중,하,랜덤):")
    print("")
    print("당신은",level,"난이도를 선택하셨습니다!")
    time.sleep(2)
    if level=='상':
        high=random.sample(상문제해설,10)
        print("자자 문제 나갑니다.")
        print("답을 모르거나 풀기 싫으면 아무키나 눌러주세요.")
        print("")
        time.sleep(2)
        score1 = print_pro(high)
    elif level=='중':
        mid=random.sample(중문제해설,10)
        print("자자 문제 나갑니다.")
        print("답을 모르거나 풀기 싫으면 아무키나 눌러주세요.")
        print("")
        time.sleep(2)
        score1 = print_pro(mid)
    elif level=='하':
        low=random.sample(하문제해설,10)
        print("자자 문제 나갑니다.")
        print("답을 모르거나 풀기 싫으면 아무키나 눌러주세요.")
        print("")
        time.sleep(2)
        score1 = print_pro(low)
    elif level=='랜덤':
        rando=random.sample(해설리스트,10)
        print("자자 문제 나갑니다.")
        print("답을 모르거나 풀기 싫으면 아무키나 눌러주세요.")
        print("")
        time.sleep(2)
        score1 = print_pro(rando)
    else:
        print(level,"난이도는 없습니다… 상,중,하,랜덤만 입력해주세요.")
        return solvepro()
    return level, score1


import time
print("안녕하세요!\n신조어 사전에 오신것을 환영합니다.")
print("")
#window=Tk()
#window.title("신조어사전 평가")
#window.geometry("300x200")
#App(window)
#window.mainloop()
namee=input("이름을 입력해주세요.:")
age=input("나이를 입력해주세요.:")
#self.namee=
#self.age=
while not age.isdigit():
    print("숫자만 입력해주세요.")
    age=input("나이를 입력해주세요!:")
age=int(age)
print("")
print(namee,"님! 반갑습니다!!")
time.sleep(1)
for i in range(223):
    if i%10 == 0:
        print("\n")
        print(문제리스트[i],end='')
    else:
        print(문제리스트[i],', ',end='')
print("\n")
while True:#문제 풀때나 while True 벗어났을때 설명 보고 싶을떄 어뜩해 해야하는지도 생각해야됨
    inword()
    print("")
    time.sleep(2)
    b=input("계속 이용하시고 싶으시면 ㅇㅇ, 그만두고 싶으시면 ㄴㄴ을 입력해주세요.:")
    print("")
    b=askag(b)
    if (b=='ㄴㄴ'):
        print("")
        break
print("문제를 풀 차례입니다.")#여기에다가도 반복문 넣을지 결정
import random
c=input("문제를 풀고 싶으시면 ㅇㅇ, 그만두고 싶으시면 ㄴㄴ을 입력해주세요.:")
c=askag(c)
if (c=='ㄴㄴ'):
    print("끝났습니다. ㅅㄱ요")
if (c=='ㅇㅇ'):
    print("문제 풀러 갑시다")
    print("")
    age_recomend()
    time.sleep(1)
    level, score1=solvepro()
    classs()
    while True:
        time.sleep(2)
        review_ask=input("재시험을 보고 싶으면 ㅇㅇ,싫으면 ㄴㄴ을 누르세요:")#게속 반복하려면 어뜩해 해야되는지 알아보길
        review_ask=askag(review_ask)
        if (review_ask=='ㄴㄴ'):
            print("점수 확인하고 가세요")
            break
        if (review_ask=='ㅇㅇ'):
            level, score1=solvepro()
    print("['이름','나이','난이도','점수']")
    print([namee,age,level,score1])
print("신조어사전을 평가해 주시기 바랍니다.")
window=Tk()
window.title("신조어사전 평가")
window.geometry("300x200")
App(window)
window.mainloop()
#if self.review == ㅇ:
#    print("1/5점을 주셨습니다. 이용해주셔서 감사합니다!")
#elif self.review == ㅇㅇ:
#    print("2/5점을 주셨습니다. 이용해주셔서 감사합니다!")
#elif self.review == ㅇㅇㅇ:
#    print("3/5점을 주셨습니다. 이용해주셔서 감사합니다!")
#elif self.review == ㅇㅇㅇㅇ:
#    print("4/5점을 주셨습니다. 이용해주셔서 감사합니다!")
#elif self.review == ㅇㅇㅇㅇㅇ:
#   print("5/5점을 주셨습니다. 이용해주셔서 감사합니다!")
#nwd=load_nwd()
#   nwd
print("이용해주셔서 감사합니다!")





#def lotto():
#    comnum=random.sample(문제리스트,10)
#    print(comnum)
#    for x in range(0,3):
#            lot x=input("행운의 단어를 입력해주세요!!!!:")




#문제 푸는 함수
#문제 푸는거는 단계를 상,중,하, 랜덤출제 이런식으로 나눈다
#문제풀때 꼬리재귀쓰꼬 점수내고 정렬에서 비교하는거 차례대로

#랭킹 하는거
#단어 검색 빈도
#위에 두개는 프로그램 껐을때 저장이 안됌 (교수님한테 물어보자!)
#미니 게임-빙고,로또,낱말 퀴즈
#클래스 넣어야된다

#질문할거
#1.문자열이 안들어왔을때 혹은 해당되는 문자가 안들어왔을때(안전코딩) 근데 위에 안전코딩 안된다
#2.프로그램 내역 저장시키는거(이것도 다음주에 질문)
#3.리스트 보여주는거 깔끔하게 하는법
#4.문제 출제할때 재귀로 짜면 왜 안되는지 while문만 된다…
#5.랭킹 짜는거 질문
#문제 풀면 레벨만들어 주기
